[
  {
    "ticker": "AES",
    "name": "The AES Corporation",
    "price": 13.68,
    "dividendYield": 0.05116959064327485,
    "payoutRatio": 0.46080002,
    "consecutiveYears": 8,
    "peRatio": 5.9129653,
    "roe": 0.05106,
    "debtToEquity": 3.02896,
    "low52": 9.46,
    "high52": 15.51,
    "sector": "Utilities",
    "dividendGrowth5Y": 0.04776794382678351,
    "description": "The AES Corporation, together with its subsidiaries, operates as a power generation and utility company in the United States and internationally. The company owns and/or operates power plants to generate and sell power to customers, such as utilities, industrial users, and other intermediaries; owns and/or operates utilities to generate or purchase, distribute, transmit, and sell electricity to end-user customers in the residential, commercial, industrial, and governmental sectors; and generates and sells electricity on the wholesale market. It uses various fuels and technologies to generate electricity, such as coal, gas, hydro, wind, solar, and biomass, as well as renewables comprising energy storage and landfill gas. The company owns and/or operates a generation portfolio of approximately 32,109 megawatts and distributes power to 2.7 million customers. The company was formerly known as Applied Energy Services, Inc. and changed its name to The AES Corporation in April 2000. The AES Corporation was incorporated in 1981 and is headquartered in Arlington, Virginia.",
    "lastUpdated": "2025-12-19"
  },
  {
    "ticker": "ARE",
    "name": "Alexandria Real Estate Equities",
    "price": 48.95,
    "dividendYield": 0.09560776302349334,
    "payoutRatio": 0.068946996,
    "consecutiveYears": 9,
    "peRatio": 14.229651,
    "roe": -0.01084,
    "debtToEquity": 0.66083,
    "low52": 44.1,
    "high52": 105.14,
    "sector": "Real Estate",
    "dividendGrowth5Y": 0.05346830376909706,
    "description": "Alexandria, an S&P 500 company, is a best-in-class, mission-driven life science REIT making a positive and lasting impact on the world. With our founding in 1994, Alexandria pioneered the life science real estate niche. Alexandria is the preeminent and longest-tenured owner, operator, and developer of collaborative Megacampus ecosystems in AAA life science innovation cluster locations, including Greater Boston, the San Francisco Bay Area, San Diego, Seattle, Maryland, Research Triangle and New York City.",
    "lastUpdated": "2025-12-19"
  },
  {
    "ticker": "MO",
    "name": "Altria Group, Inc.",
    "price": 58.39,
    "dividendYield": 0.07261517383113547,
    "payoutRatio": 0.78629994,
    "consecutiveYears": 9,
    "peRatio": 10.449776,
    "roe": 0,
    "debtToEquity": 0,
    "low52": 50.08,
    "high52": 68.6,
    "sector": "Consumer Defensive",
    "dividendGrowth5Y": 0.04048836820440749,
    "description": "Altria Group, Inc., through its subsidiaries, manufactures and sells smokeable and oral tobacco products in the United States. The company offers cigarettes primarily under the Marlboro brand; large cigars and pipe tobacco under the Black & Mild brand; moist smokeless tobacco and oral tobacco products under the Copenhagen, Skoal, Red Seal, and Husky brands; oral nicotine pouches under the on! brand; and e-vapor products under the NJOY ACE brand. It sells its products to distributors, as well as large retail organizations, such as chain stores. Altria Group, Inc. was founded in 1822 and is headquartered in Richmond, Virginia.",
    "lastUpdated": "2025-12-19"
  },
  {
    "ticker": "AMCR",
    "name": "Amcor plc",
    "price": 8.34,
    "dividendYield": 0.06235011990407674,
    "payoutRatio": 1.6944001,
    "consecutiveYears": 4,
    "peRatio": 9.345376,
    "roe": 0.07467,
    "debtToEquity": 1.3468,
    "low52": 7.67,
    "high52": 10.45,
    "sector": "Consumer Cyclical",
    "dividendGrowth5Y": -0.0226327639842,
    "description": "Amcor plc, together with its subsidiaries, engages in the production and sale of packaging products in Europe, North America, Latin America, and the Asia Pacific. The company operates in two segments, Global Flexible Packaging Solutions and Global Rigid Packaging Solutions. The Global Flexible Packaging Solutions segment develops and supplies flexible packaging products, including polymer resin, aluminum, and fiber based flexible packaging products to the food and beverage, medical and pharmaceutical, fresh produce, snack food, personal care, and other industries. The Global Rigid Packaging Solutions segment manufactures rigid packaging containers, closures, dispensing and pharma devices, and related products for the food and beverage applications. The company sells its products through its direct sales force. The company was incorporated in 1926 and is headquartered in Zurich, Switzerland.",
    "lastUpdated": "2025-12-19"
  },
  {
    "ticker": "APA",
    "name": "APA Corporation",
    "price": 23.81,
    "dividendYield": 0.041999160016799666,
    "payoutRatio": 0.2392,
    "consecutiveYears": 3,
    "peRatio": 8.84719,
    "roe": 0.27427998,
    "debtToEquity": 0.6689499999999999,
    "low52": 13.58,
    "high52": 27.72,
    "sector": "Energy",
    "dividendGrowth5Y": 0.0,
    "description": "APA Corporation, an independent energy company, explores for, develops, and produces natural gas, crude oil, and natural gas liquids. It has oil and gas operations in the United States, Egypt, and North Sea. The company also has exploration and appraisal activities in Suriname, as well as holds interests in projects located in Uruguay and internationally. APA Corporation was incorporated in 1954 and is headquartered in Houston, Texas.",
    "lastUpdated": "2025-12-19"
  },
  {
    "ticker": "T",
    "name": "AT&T Inc.",
    "price": 24.26,
    "dividendYield": 0.045754328112118714,
    "payoutRatio": 0.3616,
    "consecutiveYears": 1,
    "peRatio": 10.858376,
    "roe": 0.19139999,
    "debtToEquity": 1.2441200000000001,
    "low52": 21.38,
    "high52": 29.79,
    "sector": "Communication Services",
    "dividendGrowth5Y": -0.11428311506589084,
    "description": "AT&T Inc. provides telecommunications and technology services worldwide. The company operates through two segments, Communications and Latin America. The Communications segment offers wireless voice and data communications services; and sells handsets, wireless data cards, wireless computing devices, carrying cases/protective covers, and wireless chargers through its own company-owned stores, agents, and third-party retail stores. It also provides AT&T Dedicated Internet, fiber ethernet and broadband, fixed wireless, and hosted and managed professional services; and copper-based voice and data, Virtual Private Networks (VPN), wholesale, outsourcing, and IP, as well as customer premises equipment for multinational corporations, small and mid-sized businesses, governmental, and wholesale customers. In addition, this segment offers broadband services, including fiber connections, legacy telephony voice communication services, and other VoIP services and equipment to residential customers. This segment markets its communications services and products under the AT&T, AT&T Business, Cricket, AT&T PREPAID, AT&T Fiber, and AT&T Internet Air brand names. The Latin America segment provides postpaid and prepaid wireless services in Mexico under the AT&T and Unefon brand names, as well as sells smartphones through its stores, agents and third-party retail stores. The company was formerly known as SBC Communications Inc. and changed its name to AT&T Inc. in 2005. AT&T Inc. was incorporated in 1983 and is based in Dallas, Texas.",
    "lastUpdated": "2025-12-19"
  },
  {
    "ticker": "BBY",
    "name": "Best Buy Co., Inc.",
    "price": 71.76,
    "dividendYield": 0.052954292084726864,
    "payoutRatio": 1.2508,
    "consecutiveYears": 7,
    "peRatio": 10.632104,
    "roe": 0.22493,
    "debtToEquity": 1.54542,
    "low52": 54.99,
    "high52": 91.68,
    "sector": "Consumer Cyclical",
    "dividendGrowth5Y": 0.1345707157370173,
    "description": "Best Buy Co., Inc. offers technology products and solutions in the United States, Canada, and internationally. It provides computing and mobile phone products, such as desktops, notebooks, and peripherals; mobile phones comprising related mobile network carrier commissions; networking products; tablets covering e-readers; smartwatches; and consumer electronics consisting of digital imaging, health and fitness products, portable audio comprising headphones and portable speakers, and smart home products, as well as home theaters that includes home theater accessories, soundbars, and televisions. The company's stores also offer appliances, such as dishwashers, laundry, ovens, refrigerators, blenders, coffee makers, vacuums, and personal care; entertainment products consisting of drones, peripherals, movies, and toys, as well as hardware and software, and virtual reality and other software products; and other products, such as baby, food and beverage, luggage, and outdoor living products. In addition, it provides delivery, installation, memberships, repair, set-up, technical support, health-related, and warranty-related services. The company offers its products through stores and websites under the Best Buy, Best Buy Ads, Best Buy Business, Best Buy Essentials, Best Buy Health, Current Health, Geek Squad, Imagine That, Insignia, Lively, My Best Buy, My Best Buy Memberships, Pacific Kitchen, Home, TechLiquidators, and Yardbird brand names, as well as domain names comprising bestbuy.com, currenthealth.com, lively.com, techliquidators.com, yardbird.com, bestbuy.ca, and techliquidators.ca. The company was formerly known as Sound of Music, Inc. Best Buy Co., Inc. was incorporated in 1966 and is headquartered in Richfield, Minnesota.",
    "lastUpdated": "2025-12-19"
  },
  {
    "ticker": "BMY",
    "name": "Bristol-Myers Squibb Company",
    "price": 53.33,
    "dividendYield": 0.047252953309581854,
    "payoutRatio": 0.835,
    "consecutiveYears": 3,
    "peRatio": 8.89499,
    "roe": 0.33777002,
    "debtToEquity": 2.74414,
    "low52": 42.52,
    "high52": 63.33,
    "sector": "Healthcare",
    "dividendGrowth5Y": 0.07912928578583145,
    "description": "Bristol-Myers Squibb Company discovers, develops, licenses, manufactures, markets, distributes, and sells biopharmaceutical products worldwide. It offers products for oncology, hematology, immunology, cardiovascular, neuroscience, and other areas. The company's products include Eliquis for reduction in risk of stroke/systemic embolism in non-valvular atrial fibrillation and for the treatment of DVT/PE; Opdivo for various anti-cancer indications; Pomalyst/Imnovid for multiple myeloma; Orencia for active rheumatoid arthritis and psoriatic arthritis; and Sprycel to treat patients with Philadelphia chromosome-positive chronic myeloid leukemia. It also provides Yervoy for the treatment of patients with unresectable or metastatic melanoma; Empliciti for the treatment of relapsed/refractory multiple myeloma; Abecma for the treatment of patients with relapsed or refractory multiple myeloma; Reblozyl to treat anemia; Opdualag for the treatment of unresectable or metastatic melanoma; and Zeposia to treat relapsing forms of multiple sclerosis. In addition, the company offers Breyanzi for the treatment of patients with relapsed or refractory large B-cell lymphoma; Cobenfy to treat schizophrenia in adults; Krazati for the treatment of adult patients with KRASG12C-mutated locally advanced or metastatic non-small cell lung cancer (NSCLC); Camzyos to treat symptomatic obstructive HCM to improve functional capacity and symptom; Sotyktu for the treatment of moderate-to-severe plaque psoriasis; Augtyro for the treatment of locally advanced or metastatic ROS1-positive NSCLC; Revlimid, an oral immunomodulatory drug to treat multiple myeloma; and Abraxane for the treatment of breast cancer, NSCLC and pancreatic cancer. It sells products to wholesalers, distributors, pharmacies, retailers, hospitals, clinics, and government agencies. The company was formerly known as Bristol-Myers Company. Bristol-Myers Squibb Company was founded in 1887 and is headquartered in Princeton, New Jersey.",
    "lastUpdated": "2025-12-19"
  },
  {
    "ticker": "BXP",
    "name": "BXP, Inc.",
    "price": 69.19,
    "dividendYield": 0.04046827576239341,
    "payoutRatio": 1.96,
    "consecutiveYears": 9,
    "peRatio": 33.806137,
    "roe": -0.01883,
    "debtToEquity": 2.31148,
    "low52": 54.22,
    "high52": 79.33,
    "sector": "Real Estate",
    "dividendGrowth5Y": 0.004656176580601912,
    "description": "BXP, Inc. (NYSE: BXP) is the largest publicly traded developer, owner, and manager of premier workplaces in the United States, concentrated in six dynamic gateway markets - Boston, Los Angeles, New York, San Francisco, Seattle, and Washington, DC. BXP has delivered places that power progress for our clients and communities for more than 55 years. BXP is a fully integrated real estate company, organized as a real estate investment trust (REIT). As of September 30, 2025, including properties owned by unconsolidated joint ventures, BXP's portfolio totals 54.6 million square feet and 187 properties, including eight properties under construction/redevelopment.",
    "lastUpdated": "2025-12-19"
  },
  {
    "ticker": "CPB",
    "name": "The Campbell's Company",
    "price": 28.69,
    "dividendYield": 0.05437434646218194,
    "payoutRatio": 0.80410004,
    "consecutiveYears": 8,
    "peRatio": 10.923823,
    "roe": 0.14815,
    "debtToEquity": 1.8456700000000001,
    "low52": 27.85,
    "high52": 43.85,
    "sector": "Consumer Defensive",
    "dividendGrowth5Y": 0.0111759598354646,
    "description": "The Campbell's Company, together with its subsidiaries, manufactures and markets food and beverage products in the United States and internationally. It operates through Meals & Beverages, and Snacks segments. The Meals & Beverages segment engages in the retail and foodservice businesses in the United States and Canada. This segment provides Campbell's condensed and ready-to-serve soups; Swanson broth and stocks; Pacific Foods broth, soups, and non-dairy beverages; Prego pasta sauces; Pace Mexican sauces; Campbell's gravies, pasta, beans, and dinner sauces; Swanson canned poultry; V8 juices and beverages; Campbell's tomato juice; Rao's pasta sauces, dry pasta, frozen entrées, frozen pizza, and soups; and Michael Angelo's frozen entrées and pasta sauces, as well as snacking products in foodservice in Canada. Its Snacks segment retails Pepperidge Farm cookies, crackers, fresh bakery, and frozen products, that includes Goldfish crackers, Snyder's of Hanover pretzels, Lance sandwich crackers, Cape Cod and Kettle Brand potato chips, Late July snacks, Snack Factory pretzel crisps, and other snacking products. This segment is also involved in the snacking, and meals and beverage retail business in Latin America. It sells its products through retail food chains, mass discounters and merchandisers, club stores, convenience and dollar stores, e-commerce and other retail, commercial, and non-commercial establishments, and independent contractor distributors. The company was formerly known as Campbell Soup Company and changed its name to The Campbell's Company in November 2024. The Campbell's Company was founded in 1869 and is headquartered in Camden, New Jersey.",
    "lastUpdated": "2025-12-19"
  },
  {
    "ticker": "CVX",
    "name": "Chevron Corporation",
    "price": 147.69,
    "dividendYield": 0.04631322364411944,
    "payoutRatio": 0.9508,
    "consecutiveYears": 8,
    "peRatio": 19.556643,
    "roe": 0.07316,
    "debtToEquity": 0.21239,
    "low52": 132.04,
    "high52": 168.96,
    "sector": "Energy",
    "dividendGrowth5Y": 0.06494732893470956,
    "description": "Chevron Corporation, through its subsidiaries, engages in the integrated energy and chemicals operations in the United States and internationally. The company operates in two segments, Upstream and Downstream. The Upstream segment engages in the exploration, development, production, and transportation of crude oil and natural gas; liquefaction, transportation, and regasification of liquefied natural gas; transporting crude oil through pipelines; processing, transporting, storage, and marketing of natural gas; and carbon capture and storage, as well as a gas-to-liquids plant. The Downstream segment refines crude oil into petroleum products; markets crude oil, refined products, and lubricants; manufactures and markets renewable fuels; transports crude oil and refined products through pipeline, marine vessel, motor equipment, and rail car; and manufactures and markets commodity petrochemicals, plastics for industrial uses, and fuel and lubricant additives. The company was formerly known as ChevronTexaco Corporation and changed its name to Chevron Corporation in 2005. Chevron Corporation was founded in 1879 and is headquartered in Houston, Texas.",
    "lastUpdated": "2025-12-19"
  },
  {
    "ticker": "CLX",
    "name": "Clorox Company (The)",
    "price": 99.39,
    "dividendYield": 0.049904416943354464,
    "payoutRatio": 0.76919997,
    "consecutiveYears": 8,
    "peRatio": 14.709822,
    "roe": 4.43646,
    "debtToEquity": 22.30435,
    "low52": 98.2,
    "high52": 165.0,
    "sector": "Consumer Defensive",
    "dividendGrowth5Y": 0.036794773644571954,
    "description": "The Clorox Company manufactures and markets consumer and professional products worldwide. The company operates through four segments: Health and Wellness, Household, Lifestyle, and International. The Health and Wellness segment offers home care cleaning and disinfecting products, bleach, clog removers, and laundry additives under the Clorox, Clorox2, Pine-Sol, Scentiva, Tilex, Liquid-Plumr, Poett, and Formula 409 brands; professional cleaning and disinfecting products under the CloroxPro and Clorox Healthcare brands; professional food service products under the Hidden Valley brand in the United States. The Household segment provides cat litter products under the Fresh Step and Scoop Away brands; bags and wraps under the Glad brand; and grilling products under the Kingsford brand in the United States. The Lifestyle segment offers dressings, dips, seasonings, and sauces primarily under the Hidden Valley brand; water-filtration products under the Brita brand; and natural personal care products under the Burt's Bees brand in the United States. The International segment provides laundry additives, home care products, bags and wraps, cat litter products, water-filtration systems, professional cleaning and disinfecting products, natural personal care products, food, grilling products, and digestive health products internationally primarily under the Clorox, Glad, Poett, Brita, Burt's Bees, Pine-Sol, Ever Clean, Clorinda, Chux and Fresh Step Brands. It also offers vitamins, minerals, and supplement products under the Natural Vitality, RenewLife, NeoCell, and Rainbow Light brands. The company sells its products through mass retailers; grocery outlets; warehouse clubs; dollar stores; home hardware centers; drug, pet, and military stores; third-party and owned e-commerce channels; and distributors, as well as a direct sales force. The company was founded in 1913 and is headquartered in Oakland, California.",
    "lastUpdated": "2025-12-19"
  },
  {
    "ticker": "CMCSA",
    "name": "Comcast Corporation",
    "price": 30.27,
    "dividendYield": 0.043607532210109025,
    "payoutRatio": 0.2159,
    "consecutiveYears": 5,
    "peRatio": 7.266852,
    "roe": 0.24186,
    "debtToEquity": 1.01462,
    "low52": 25.75,
    "high52": 38.46,
    "sector": "Communication Services",
    "dividendGrowth5Y": 0.14131061424313218,
    "description": "Comcast Corporation operates as a media and technology company worldwide. It operates through Residential Connectivity & Platforms, Business Services Connectivity, Media, Studios, and Theme Parks segments. The Residential Connectivity & Platforms segment provides residential broadband and wireless connectivity services, residential and business video services, sky-branded entertainment television networks, and advertising. The Business Services Connectivity segment offers connectivity services for small business locations, which include broadband, wireline voice, and wireless services; and ethernet network services for medium-sized customers and larger enterprises. The Media segment operates NBCUniversal's national and regional cable networks; the NBC and Telemundo broadcast networks and owned local broadcast television stations; and Peacock, a direct-to-consumer streaming services. It also operates international television networks comprising the Sky Sports networks, as well as other digital properties. The Studios segment operates NBCUniversal and Sky film and television studio production and distribution operations. The Theme Parks segment operates Universal theme parks in Orlando, Florida; Hollywood, California; Osaka, Japan; and Beijing, China. The company also offers a consolidated streaming platforms under the Philadelphia Flyers and the Wells Fargo Center arena in Philadelphia, Pennsylvania; and Xumo. Comcast Corporation was founded in 1963 and is based in Philadelphia, Pennsylvania.",
    "lastUpdated": "2025-12-19"
  },
  {
    "ticker": "CAG",
    "name": "ConAgra Brands, Inc.",
    "price": 17.8,
    "dividendYield": 0.07865168539325842,
    "payoutRatio": 0.791,
    "consecutiveYears": 8,
    "peRatio": 9.612944,
    "roe": 0.096540004,
    "debtToEquity": 0.92867,
    "low52": 16.6,
    "high52": 28.52,
    "sector": "Consumer Defensive",
    "dividendGrowth5Y": 0.1044287111076303,
    "description": "Conagra Brands, Inc., together with its subsidiaries, operates as a consumer packaged goods food company primarily in the United States. The company operates in four segments: Grocery & Snacks, Refrigerated & Frozen, International, and Foodservice. The Grocery & Snacks segment primarily offers shelf stable food products through various retail channels. The Refrigerated & Frozen segment provides temperature-controlled food products through various retail channels. The International segment offers food products in various temperature states through retail and foodservice channels outside of the United States. The Foodservice segment offers branded and customized food products, including meals, entrees, sauces, and various custom-manufactured culinary products packaged for restaurants and other foodservice establishments. The company sells its products under the Birds Eye, Marie Callender's, Duncan Hines, Healthy Choice, Slim Jim, Reddi-wip, Angie's, BOOMCHICKAPOP brands. Conagra Brands, Inc. was incorporated in 1919 and is headquartered in Chicago, Illinois.",
    "lastUpdated": "2025-12-19"
  },
  {
    "ticker": "CCI",
    "name": "Crown Castle Inc.",
    "price": 86.9,
    "dividendYield": 0.048906789413118525,
    "payoutRatio": 0.022199001,
    "consecutiveYears": 8,
    "peRatio": 25.298399,
    "roe": -2.06679,
    "debtToEquity": 0,
    "low52": 84.2,
    "high52": 115.76,
    "sector": "Real Estate",
    "dividendGrowth5Y": 0.06472302751511871,
    "description": "Crown Castle owns, operates and leases approximately 40,000 cell towers and approximately 90,000 route miles of fiber supporting small cells and fiber solutions across every major U.S. market. This nationwide portfolio of communications infrastructure connects cities and communities to essential data, technology and wireless service \u0096 bringing information, ideas and innovations to the people and businesses that need them.",
    "lastUpdated": "2025-12-19"
  },
  {
    "ticker": "D",
    "name": "Dominion Energy, Inc.",
    "price": 60.1,
    "dividendYield": 0.044425956738768715,
    "payoutRatio": 0.8725,
    "consecutiveYears": 3,
    "peRatio": 16.671244,
    "roe": 0.09204,
    "debtToEquity": 1.54315,
    "low52": 48.07,
    "high52": 62.87,
    "sector": "Utilities",
    "dividendGrowth5Y": -0.06160268548478287,
    "description": "Dominion Energy, Inc. provides regulated electricity and natural gas services in the United States. It operates through Dominion Energy Virginia, Dominion Energy South Carolina, and Contracted Energy segments. The Dominion Energy Virginia segment engages in the generation, distribution, and transmission of electricity to approximately 2.8 million residential, commercial, industrial, and governmental customers in Virginia and North Carolina. The Dominion Energy South Carolina segment generates, transmits, and distributes electricity to approximately 0.8 million customers in the central, southern, and southwestern portions of South Carolina; and distributes natural gas to approximately 0.5 million residential, commercial, and industrial customers in South Carolina. The Contracted Energy segment is involved in the nonregulated long-term contracted renewable electric generation fleet and renewable natural gas facility. As of December 31, 2024, the company's portfolio of assets included approximately 30.3 GW of electric generating capacity, 10,600 miles of electric transmission lines, and 79,700 miles of electric distribution lines. The company was formerly known as Dominion Resources, Inc. Dominion Energy, Inc. was incorporated in 1983 and is headquartered in Richmond, Virginia.",
    "lastUpdated": "2025-12-19"
  },
  {
    "ticker": "DOW",
    "name": "Dow Inc.",
    "price": 23.04,
    "dividendYield": 0.06076388888888889,
    "payoutRatio": 0.07,
    "consecutiveYears": 5,
    "peRatio": -112.907974,
    "roe": -0.05287,
    "debtToEquity": 1.02943,
    "low52": 20.402,
    "high52": 42.174,
    "sector": "Basic Materials",
    "dividendGrowth5Y": 0.059223841048812176,
    "description": "Dow Inc., through its subsidiaries, provides various materials science solutions for packaging, infrastructure, mobility, and consumer applications in the United States, Canada, Europe, the Middle East, Africa, India, the Asia Pacific, and Latin America. The company operates through Packaging & Specialty Plastics, Industrial Intermediates & Infrastructure, and Performance Materials & Coatings segments. The Packaging & Specialty Plastics segment provides ethylene, propylene, polyethylene, and aromatics products; and other ethylene derivatives, such as polyolefin elastomers, ethylene vinyl acetate, and ethylene propylene diene monomer rubber. The Industrial Intermediates & Infrastructure segment offers polyurethanes, including propylene oxide, propylene glycol, and polyether polyols; aromatic isocyanates and fully formulated polyurethane systems; and chlor-alkali and vinyl comprising chlorine and caustic soda, ethylene dichloride, and vinyl chloride monomer; and construction chemicals consisting of cellulose ethers, redispersible latex powders, and acrylic emulsions, as well as coatings, adhesives, sealants, elastomers, and composites. The Performance Materials & Coatings segment provides architectural paints and coatings, and industrial coatings; and acrylics-based building blocks, silicon metals, siloxanes, and intermediates. The company also engages in the property and casualty insurance, as well as reinsurance business. Dow Inc. was founded in 1897 and is headquartered in Midland, Michigan.",
    "lastUpdated": "2025-12-19"
  },
  {
    "ticker": "EIX",
    "name": "Edison International",
    "price": 60.17,
    "dividendYield": 0.05833471829815522,
    "payoutRatio": 0.4338,
    "consecutiveYears": 0,
    "peRatio": 9.771616,
    "roe": 0.15765001,
    "debtToEquity": 2.0402,
    "low52": 47.73,
    "high52": 81.02,
    "sector": "Utilities",
    "dividendGrowth5Y": -0.011314943245667508,
    "description": "Edison International, through its subsidiaries, engages in the generation and distribution of electric power. The company supplies and delivers through its electrical infrastructure to an approximately 50,000 square-mile area of southern California. It serves residential, commercial, industrial, public authorities, agricultural, and other sectors. The company's distribution network consists of approximately 13,000 circuit-miles of lines ranging from 55 kV to 500 kV and approximately 80 transmission substations; and approximately 38,000 circuit-miles of overhead lines, approximately 32,000 circuit-miles of underground lines, and approximately 730 distribution substations. Edison International was founded in 1886 and is based in Rosemead, California.",
    "lastUpdated": "2025-12-19"
  },
  {
    "ticker": "EQR",
    "name": "Equity Residential",
    "price": 62.09,
    "dividendYield": 0.044612659043324204,
    "payoutRatio": 0.90629995,
    "consecutiveYears": 0,
    "peRatio": 43.392574,
    "roe": 0.10444,
    "debtToEquity": 0.76237,
    "low52": 58.38,
    "high52": 75.86,
    "sector": "Real Estate",
    "dividendGrowth5Y": -0.022755263210998966,
    "description": "Equity Residential is committed to creating communities where people thrive. The Company, a member of the S&P 500, owns and manages 318 rental properties consisting of 86,320 apartment units in dynamic metro areas across the U.S. with a primary concentration in major coastal markets, diversified by a targeted presence in the high-growth metro areas of Atlanta, Austin, Dallas/Ft. Worth and Denver.",
    "lastUpdated": "2025-12-19"
  },
  {
    "ticker": "ES",
    "name": "Eversource Energy (D/B/A)",
    "price": 67.98,
    "dividendYield": 0.044277728743748156,
    "payoutRatio": 0.8211,
    "consecutiveYears": 8,
    "peRatio": 13.623574,
    "roe": 0.0861,
    "debtToEquity": 1.84357,
    "low52": 52.28,
    "high52": 75.25,
    "sector": "Utilities",
    "dividendGrowth5Y": 0.05971834352437777,
    "description": "Eversource Energy, a public utility holding company, engages in the energy delivery business. The company operates through Electric Distribution, Electric Transmission, Natural Gas Distribution, and Water Distribution segments. It is involved in the transmission and distribution of electricity; solar power facilities; and distribution of natural gas. The company operates regulated water utilities that provide water services to residential, commercial, industrial, municipal and fire protection, and other customers in Connecticut, Massachusetts, and New Hampshire. The company was formerly known as Northeast Utilities and changed its name to Eversource Energy in April 2015. Eversource Energy was incorporated in 1927 and is headquartered in Springfield, Massachusetts.",
    "lastUpdated": "2025-12-19"
  },
  {
    "ticker": "EXR",
    "name": "Extra Space Storage Inc",
    "price": 130.89,
    "dividendYield": 0.04950721980288793,
    "payoutRatio": 1.4497,
    "consecutiveYears": 8,
    "peRatio": 27.068722,
    "roe": 0.06786,
    "debtToEquity": 0.9425199999999999,
    "low52": 121.03,
    "high52": 162.77,
    "sector": "Real Estate",
    "dividendGrowth5Y": 0.12726234884451304,
    "description": "Extra Space Storage Inc., headquartered in Salt Lake City, Utah, is a self-administered and self-managed REIT and a member of the S&P 500. As of September 30, 2025, the Company owned and/or operated 4,238 self-storage stores in 43 states and Washington, D.C.The Company's stores comprise approximately 2.9 million units and approximately 326.9 million square feet of rentable space operating under the Extra Space brand. The Company offers customers a wide selection of conveniently located and secure storage units across the country, including boat storage, RV storage and business storage. It is the largest operator of self-storage properties in the United States.",
    "lastUpdated": "2025-12-19"
  },
  {
    "ticker": "FRT",
    "name": "Federal Realty Investment Trust",
    "price": 101.65,
    "dividendYield": 0.04446630595179537,
    "payoutRatio": 1.1244,
    "consecutiveYears": 0,
    "peRatio": 32.182693,
    "roe": 0.10516,
    "debtToEquity": 1.3876,
    "low52": 80.65,
    "high52": 113.13,
    "sector": "Real Estate",
    "dividendGrowth5Y": -0.045502708172186046,
    "description": "Federal Realty is a recognized leader in the ownership, operation and redevelopment of high-quality retail-based properties located primarily in major coastal markets and select underserved regions with strong economic and demographic fundamentals. Founded in 1962, Federal Realty's mission is to deliver long-term, sustainable growth through investing in communities where retail demand exceeds supply. This includes a portfolio of open-air shopping centers and mixed-use destinations\u0097such as Santana Row, Pike & Rose and Assembly Row\u0097which together reflect the company's ability to create distinctive, high-performing environments that serve as vibrant destinations for their communities. Federal Realty's 103 properties include approximately 3,600 tenants in 27.9 million commercial square feet, and approximately 3,000 residential units. Federal Realty has increased its quarterly dividends to its shareholders for 58 consecutive years, the longest record in the REIT industry. The company is an S&P 500 index member, and its shares are traded on the NYSE under the symbol FRT.",
    "lastUpdated": "2025-12-19"
  },
  {
    "ticker": "F",
    "name": "Ford Motor Company",
    "price": 13.32,
    "dividendYield": 0.04504504504504504,
    "payoutRatio": 0.641,
    "consecutiveYears": 0,
    "peRatio": 9.01889,
    "roe": 0.10295,
    "debtToEquity": 3.46673,
    "low52": 8.44,
    "high52": 13.99,
    "sector": "Consumer Cyclical",
    "dividendGrowth5Y": 0.05387395206178347,
    "description": "Ford Motor Company develops, delivers, and services Ford trucks, sport utility vehicles, commercial vans and cars, and Lincoln luxury vehicles worldwide. It operates through Ford Blue, Ford Model e, Ford Pro, and Ford Credit segments. The company sells Ford and Lincoln internal combustion engine and hybrid vehicles, electric vehicles, service parts, accessories, and digital services for retail customers, as well as develops software. It also sells Ford and Lincoln vehicles, service parts, and accessories through distributors and dealers, as well as through dealerships to commercial fleet customers, daily rental car companies, and governments. In addition, it engages in the vehicle-related financing and leasing activities to and through automotive dealers. Further, the company provides retail installment sale contracts for new and used vehicles; and direct financing leases for new vehicles to retail and commercial customers, such as leasing companies, government entities, daily rental companies, and fleet customers. Additionally, it offers wholesale loans to dealers to finance the purchase of vehicle inventory; and loans to dealers to finance working capital and enhance dealership facilities, purchase dealership real estate, and other dealer vehicle programs. The company was incorporated in 1903 and is based in Dearborn, Michigan.",
    "lastUpdated": "2025-12-19"
  },
  {
    "ticker": "BEN",
    "name": "Franklin Resources, Inc.",
    "price": 23.9,
    "dividendYield": 0.05355648535564854,
    "payoutRatio": 1.4066,
    "consecutiveYears": 1,
    "peRatio": 8.586558,
    "roe": 0.03818,
    "debtToEquity": 0.23699,
    "low52": 16.25,
    "high52": 26.08,
    "sector": "Financial Services",
    "dividendGrowth5Y": 0.08239819622948685,
    "description": "Franklin Resources, Inc. is a publicly owned asset investment manager. Through its subsidiaries, the firm provides its services to individuals, institutions, pension plans, trusts, and partnerships. It launches equity, fixed income, balanced, and multi-asset mutual funds through its subsidiaries. The firm invests in the public equity, fixed income, and alternative markets. Franklin Resources, Inc. was founded in 1947 and is based in San Mateo, California with an additional office in Calgary, Alberta; Dubai, United Arab Emirates; Edinburgh, Midlothian; Fort Lauderdale, Florida; Hyderabad, India; London, Greater London; Rancho Cordova, California; Shanghai, Shanghai Province; Singapore; Stamford, Connecticut; and Vienna.",
    "lastUpdated": "2025-12-19"
  },
  {
    "ticker": "GIS",
    "name": "General Mills, Inc.",
    "price": 48.71,
    "dividendYield": 0.050092383494149045,
    "payoutRatio": 0.5204,
    "consecutiveYears": 8,
    "peRatio": 12.983343,
    "roe": 0.27173,
    "debtToEquity": 1.4723,
    "low52": 45.15,
    "high52": 67.35,
    "sector": "Consumer Defensive",
    "dividendGrowth5Y": 0.039594988207552584,
    "description": "General Mills, Inc. manufactures and markets branded consumer foods worldwide. The company operates through four segments: North America Retail; International; Pet; and North America Foodservice. It offers grain, ready-to-eat cereals, refrigerated yogurt, soup, meal kits, refrigerated and frozen dough products, dessert and baking mixes, bakery flour, frozen pizza and pizza snacks, snack bars, fruit and savory snacks, ice cream and frozen desserts, unbaked and fully baked frozen dough products, frozen hot snacks, ethnic meals, side dish mixes, frozen breakfast and entrees, nutrition bars, and frozen and shelf-stable vegetables. The company also manufactures and markets pet food products, including dog and cat food; and operates ice cream parlors. It markets its products under the annies, betty crocker, bisquick, blue buffalo, bugles, cascadian farm, cheerios, chex, cinnamon toast crunch, cocoa puffs, cookie crisp, dunkaroos, edgard & cooper, fiber one, by the foot, gushers, roll-ups, gardettos, gold medal, golden grahams, häagen-dazs, kitano, kix, lärabar, latina, lucky charms, as well as muir glen, nature valley, nudges, oatmeal crisp, old el paso, pillsbury, progresso, tastefuls, tiki pets, total, totinos, trix, true chews, true solutions, wanchai ferry, wheaties, wilderness, and yoki brands. In addition, the company sells its products to grocery stores, mass merchandisers, membership stores, natural food chains, drug, dollar and discount chains, e-commerce retailers, commercial and noncommercial foodservice distributors and operators, restaurants, convenience stores, and pet specialty stores. The company was founded in 1866 and is headquartered in Minneapolis, Minnesota.",
    "lastUpdated": "2025-12-19"
  },
  {
    "ticker": "DOC",
    "name": "Healthpeak Properties, Inc.",
    "price": 16.41,
    "dividendYield": 0.07434491163924437,
    "payoutRatio": 0.050417004,
    "consecutiveYears": 3,
    "peRatio": 65.64,
    "roe": -0.00115,
    "debtToEquity": 1.14248,
    "low52": 16.31,
    "high52": 21.28,
    "sector": "Real Estate",
    "dividendGrowth5Y": -0.04107662305049664,
    "description": "Healthpeak Properties, Inc. is a Standard & Poor's (\u0093S&P\u0094) 500 company that owns, operates, and develops high-quality real estate focused on healthcare discovery and delivery in the United States (\u0093U.S.\u0094). Our company was originally founded in 1985. We are organized as an umbrella partnership REIT (\u0093UPREIT\u0094). We hold substantially all of our assets and conduct our operations through our operating subsidiary, Healthpeak OP, a consolidated subsidiary of which we are the managing member. We are a Maryland corporation and qualify as a self-administered REIT. We are headquartered in Denver, Colorado, with additional corporate offices in California, Tennessee, Wisconsin, and Massachusetts and property management offices in several locations throughout the U.S. We have a diversified portfolio of high-quality healthcare properties across three core asset classes of outpatient medical, lab, and continuing care retirement community (\u0093CCRC\u0094) real estate. Under the outpatient medical and lab segments, we own, operate, and develop outpatient medical buildings, hospitals, and lab buildings. Under the CCRC segment, our properties are operated through RIDEA structures. We have other non-reportable segments that are comprised primarily of: (i) an interest in an unconsolidated joint venture that owns 19 senior housing assets (our \u0093SWF SH JV\u0094), (ii) loans receivable, and (iii) a preferred equity investment. These non-reportable segments have been presented on a combined basis herein. At September 30, 2025, our portfolio of investments, including properties in certain of our unconsolidated joint ventures, consisted of interests in 703 properties: (i) Outpatient medical \u0096 530 properties; (ii) Lab \u0096 139 properties; (iii) CCRC \u0096 15 properties; and (iv) Other non-reportable \u0096 19 properties.",
    "lastUpdated": "2025-12-19"
  },
  {
    "ticker": "HRL",
    "name": "Hormel Foods Corporation",
    "price": 24.0,
    "dividendYield": 0.048749999999999995,
    "payoutRatio": 1.3333,
    "consecutiveYears": 8,
    "peRatio": 15.403475,
    "roe": 0.06002,
    "debtToEquity": 0.3822,
    "low52": 21.03,
    "high52": 32.07,
    "sector": "Consumer Defensive",
    "dividendGrowth5Y": 0.06148394092573217,
    "description": "Hormel Foods Corporation develops, processes, and distributes various meat, nuts, and other food products to foodservice, convenience store, and commercial customers in the United States and internationally. It operates through three segments: Retail, Foodservice, and International segments. The company provides various perishable products, including resh meats, frozen items, refrigerated meal solutions, bacon, sausages, hams, guacamole, and other items that require refrigeration; and shelf-stable products, such as canned luncheon meats, nut butters, snack nuts, chili, shelf-stable microwaveable meals, hash, stews, tortillas, salsas, tortilla chips, and other items that do not require refrigeration. It sells its products under the HORMEL, ALWAYS TENDER, APPLEGATE, AUSTIN BLUES, BACON 1, BLACK LABEL, BREAD READY, BURKE, CAFÉ H, CERATTI, CHI-CHI'S, COLUMBUS, COMPLEATS, CORN NUTS, CURE 81, DAN'S PRIZE, DI LUSSO, DINTY MOORE, DON MIGUEL, DOÑA MARIA, EMBASA, FAST \u0091N EASY, FIRE BRAISED, FONTANINI, HERDEZ, HORMEL GATHERINGS, HOUSE OF TSANG, JENNIE-O, JUSTIN'S, LA VICTORIA, LAYOUT, LLOYD'S, MARY KITCHEN, MR. PEANUT, NATURAL CHOICE, NUT-RITION, OLD SMOKEHOUSE, OVEN READY, PILLOW PACK, PLANTERS, ROSA GRANDE, SADLER'S SMOKEHOUSE, SKIPPY, SPAM, SQUARE TABLE, SPECIAL RECIPE, VALLEY FRESH, and WHOLLY brands through sales personnel, independent brokers, and distributors. The company was formerly known as Geo. A. Hormel & Company and changed its name to Hormel Foods Corporation in January 1995. Hormel Foods Corporation was founded in 1891 and is headquartered in Austin, Minnesota.",
    "lastUpdated": "2025-12-19"
  },
  {
    "ticker": "HST",
    "name": "Host Hotels & Resorts, Inc.",
    "price": 18.46,
    "dividendYield": 0.04333694474539545,
    "payoutRatio": 0.7547,
    "consecutiveYears": 3,
    "peRatio": 21.201574,
    "roe": 0.109239995,
    "debtToEquity": 0.82827,
    "low52": 12.22,
    "high52": 18.715,
    "sector": "Real Estate",
    "dividendGrowth5Y": 0.011497274155136239,
    "description": "Host Hotels & Resorts, Inc. is an S&P 500 company and is the largest lodging real estate investment trust and one of the largest owners of luxury and upper-upscale hotels. The Company currently owns 74 properties in the United States and five properties internationally totaling approximately 42,500 rooms. The Company also holds non-controlling interests in seven domestic joint ventures. Guided by a disciplined approach to capital allocation and aggressive asset management, the Company partners with premium brands such as Marriott, Ritz-Carlton, Westin, Sheraton, W, The Luxury Collection, Hyatt, Fairmont, 1 Hotels, Hilton, Four Seasons, Swissôtel, ibis and Novotel, as well as independent brands.",
    "lastUpdated": "2025-12-19"
  },
  {
    "ticker": "HPQ",
    "name": "HP Inc.",
    "price": 23.45,
    "dividendYield": 0.0511727078891258,
    "payoutRatio": 0.4368,
    "consecutiveYears": 8,
    "peRatio": 7.2281284,
    "roe": 0,
    "debtToEquity": 0,
    "low52": 21.21,
    "high52": 35.28,
    "sector": "Technology",
    "dividendGrowth5Y": 0.11232030901393086,
    "description": "HP Inc. provides personal computing, printing, 3D printing, hybrid work, gaming, and other related technologies in the United States and internationally. The company operates through three segments: Personal Systems, Printing, and Corporate Investments. The Personal Systems segment offers commercial and consumer desktops and notebooks, workstations, thin clients, retail point-of-sale systems, displays, software, hybrid systems, and endpoint security and services, as well as lifecycle services, including support and deployment, configurations, and extended warranty services. The Printing segment provides consumer and commercial printer hardware, supplies, and solutions, as well as office and home printing solutions; and focuses on graphics, 3D printing, personalization in the commercial and industrial markets. The Corporate Investments segment is involved in the business incubation and investment projects. It serves small- and medium-sized businesses, public sector, and large enterprises. The company was formerly known as Hewlett-Packard Company and changed its name to HP Inc. in October 2015. HP Inc. was founded in 1939 and is headquartered in Palo Alto, California.",
    "lastUpdated": "2025-12-19"
  },
  {
    "ticker": "IP",
    "name": "International Paper Company",
    "price": 38.6,
    "dividendYield": 0.04792746113989638,
    "payoutRatio": 1.5812,
    "consecutiveYears": 2,
    "peRatio": 16.870628,
    "roe": -0.042779997,
    "debtToEquity": 0.6147699999999999,
    "low52": 35.56,
    "high52": 60.15,
    "sector": "Consumer Cyclical",
    "dividendGrowth5Y": -0.005757725427288918,
    "description": "International Paper Company produces and sells renewable fiber-based packaging and pulp products in North America, Latin America, Europe, and North Africa. It operates through two segments, Industrial Packaging and Global Cellulose Fibers. The company offers linerboard, medium, whitetop, recycled linerboard, recycled medium and saturating kraft; and pulp for a range of applications, such as diapers, towel and tissue products, feminine care, incontinence, and other personal care products, as well as specialty pulps for use in textiles, construction materials, paints, coatings, and others. The company sells its products directly to end users and converters, as well as through agents, resellers, and distributors. The company was founded in 1898 and is headquartered in Memphis, Tennessee.",
    "lastUpdated": "2025-12-19"
  },
  {
    "ticker": "INVH",
    "name": "Invitation Homes Inc.",
    "price": 27.41,
    "dividendYield": 0.04377964246625319,
    "payoutRatio": 1.2211,
    "consecutiveYears": 0,
    "peRatio": 36.515507,
    "roe": 0.06,
    "debtToEquity": 0.8569100000000001,
    "low52": 26.02,
    "high52": 35.799,
    "sector": "Real Estate",
    "dividendGrowth5Y": 0.1679251752011599,
    "description": "Invitation Homes, an S&P 500 company, is the nation's premier single-family home leasing and management company, meeting changing lifestyle demands by providing access to high-quality homes with valued features such as close proximity to jobs and access to good schools. Our purpose, Unlock the Power of Home, reflects our commitment to providing living solutions and Genuine CARE to the growing share of people who count on the flexibility and savings of leasing a home.",
    "lastUpdated": "2025-12-19"
  },
  {
    "ticker": "IRM",
    "name": "Iron Mountain Incorporated (Del",
    "price": 78.86,
    "dividendYield": 0.04387522191224955,
    "payoutRatio": 0.056852,
    "consecutiveYears": 8,
    "peRatio": 34.803253,
    "roe": 0,
    "debtToEquity": 0,
    "low52": 72.33,
    "high52": 112.18,
    "sector": "Real Estate",
    "dividendGrowth5Y": 0.02171186365014033,
    "description": "Iron Mountain Incorporated (NYSE: IRM) is trusted by more than 240,000 customers in 61 countries, including approximately 95% of the Fortune 1000, to help unlock value and intelligence from their assets through services that transcend the physical and digital worlds. Our broad range of solutions address their information management, digital transformation, information security, data center and asset lifecycle management needs. Our longstanding commitment to safety, security, sustainability and innovation in support of our customers underpins everything we do.",
    "lastUpdated": "2025-12-19"
  },
  {
    "ticker": "KVUE",
    "name": "Kenvue Inc.",
    "price": 17.1,
    "dividendYield": 0.04853801169590643,
    "payoutRatio": 1.0967,
    "consecutiveYears": 1,
    "peRatio": 15.453577,
    "roe": 0.13469,
    "debtToEquity": 0.8565900000000001,
    "low52": 14.02,
    "high52": 25.17,
    "sector": "Consumer Defensive",
    "dividendGrowth5Y": 0.05,
    "description": "Kenvue Inc. operates as a consumer health company in the United States, Europe, the Middle East, Africa, Asia-Pacific, and Latin America. It operates through three segments: Self Care, Skin Health and Beauty, and Essential Health. The Self Care segment offers cough, cold and allergy, pain care, digestive health, smoking cessation, eye care, and other products under the Tylenol, Motrin, Benadryl, Nicorette, Zarbee's, ORSLTM, Rhinocort, Calpol, and Zyrtec brands. Its Skin Health and Beauty segment provides face and body care, hair, sun, and other care products under the Neutrogena, Aveeno, Dr.Ci:Labo, Le Petit Marseillais, Lubriderm, Rogaine, and OGX brand names. The Essential Health segment offers oral and baby, women's health, wound, and other care products under the Listerine, Johnson's, Band-Aid, and Stayfree, o.b., tampons, Carefree, and Desitin Diaper Rash brands. Kenvue Inc. was incorporated in 2022 and is headquartered in Summit, New Jersey.",
    "lastUpdated": "2025-12-19"
  },
  {
    "ticker": "KMB",
    "name": "Kimberly-Clark Corporation",
    "price": 101.51,
    "dividendYield": 0.049650280760516204,
    "payoutRatio": 0.84599996,
    "consecutiveYears": 8,
    "peRatio": 13.292844,
    "roe": 1.3688201,
    "debtToEquity": 5.00068,
    "low52": 99.22,
    "high52": 150.45,
    "sector": "Consumer Defensive",
    "dividendGrowth5Y": 0.03443813160921594,
    "description": "Kimberly-Clark Corporation, together with its subsidiaries, manufactures and markets personal care products in the United States. It operates through three segments: North America, International Personal Care, and International Family Care and Professional. The company North America segment offers disposable diapers, training and youth pants, swimpants, baby wipes, feminine and incontinence care products, reusable underwear, facial and bathroom tissue, paper towels, napkins, wipers, tissue, towels, soaps and sanitizers, and other related products under the Huggies, Pull-Ups, GoodNites, Kotex, Poise, Depend, Kleenex, Scott, Cottonelle, Viva, Wypall, and other brand names. The International Personal Care segment provides baby and child care, adult care and feminine care, including disposable diapers, training and youth pants, swimpants, baby wipes, feminine and incontinence care products, reusable underwear, and other related products under the Huggies, Kotex, Goodfeel, Intimus, Depend and other brand names. The International Family Care and Professional segment offers facial and bathroom tissue, paper towels, napkins, wipers, tissue, towels, soaps and sanitizers, and other related products under the Kleenex, Scott, Viva, Andrex, Scottex, Wypall, and other brand names. It also sells household use products directly to supermarkets, mass merchandisers, drugstores, warehouse clubs, variety and department stores, and other retail outlets, as well as through other distributors and e-commerce; and professional use products directly to distributors, manufacturing, lodging, office building, food service, and public facilities, as well as through e-commerce. Kimberly-Clark Corporation was founded in 1872 and is headquartered in Dallas, Texas.",
    "lastUpdated": "2025-12-19"
  },
  {
    "ticker": "KIM",
    "name": "Kimco Realty Corporation (HC)",
    "price": 20.28,
    "dividendYield": 0.05128205128205128,
    "payoutRatio": 1.2048,
    "consecutiveYears": 0,
    "peRatio": 25.791355,
    "roe": 0.056700002,
    "debtToEquity": 0.7819499999999999,
    "low52": 17.93,
    "high52": 23.73,
    "sector": "Real Estate",
    "dividendGrowth5Y": -0.02834801480714566,
    "description": "Kimco Realty (NYSE: KIM) is a real estate investment trust (REIT) and leading owner and operator of high-quality, open-air, grocery-anchored shopping centers and mixed-use properties in the United States. The company's portfolio is strategically concentrated in the first-ring suburbs of the top major metropolitan markets, including high-barrier-to-entry coastal markets and Sun Belt cities. Its tenant mix is focused on essential, necessity-based goods and services that drive multiple shopping trips per week. Publicly traded on the NYSE since 1991 and included in the S&P 500 Index, the company has specialized in shopping center ownership, management, acquisitions, and value-enhancing redevelopment activities for more than 65 years. With a proven commitment to corporate responsibility, Kimco Realty is a recognized industry leader in this area. As of September 30, 2025, the company owned interests in 564 U.S. shopping centers and mixed-use assets comprising 100 million square feet of gross leasable space.",
    "lastUpdated": "2025-12-19"
  },
  {
    "ticker": "KMI",
    "name": "Kinder Morgan, Inc.",
    "price": 26.34,
    "dividendYield": 0.04441913439635535,
    "payoutRatio": 0.9508,
    "consecutiveYears": 8,
    "peRatio": 19.040459,
    "roe": 0.08884,
    "debtToEquity": 1.02138,
    "low52": 23.94,
    "high52": 31.48,
    "sector": "Energy",
    "dividendGrowth5Y": 0.03840784985524692,
    "description": "Kinder Morgan, Inc. operates as an energy infrastructure company primarily in North America. The company operates through Natural Gas Pipelines, Products Pipelines, Terminals, and CO2 segments. The Natural Gas Pipelines segment owns and operates interstate and intrastate natural gas pipeline, and storage systems; natural gas gathering systems and natural gas processing and treating facilities; natural gas liquids fractionation facilities and transportation systems; and liquefied natural gas gasification, liquefaction, and storage facilities. The Products Pipelines segment owns and operates refined petroleum products, and crude oil and condensate pipelines; and associated product terminals and petroleum pipeline transmix facilities. The Terminals segment owns and/or operates liquids and bulk terminals that stores and handles various commodities, including gasoline, diesel fuel, renewable fuel and feedstocks, chemicals, ethanol, metals, and petroleum coke; and owns tankers. The CO2 segment produces, transports, and markets CO2 to recovery and production crude oil from mature oil fields; owns interests in/or operates oil fields and gasoline processing plants; and operates a crude oil pipeline system in West Texas, as well as owns and operates RNG and LNG facilities. The company was formerly known as Kinder Morgan Holdco LLC and changed its name to Kinder Morgan, Inc. in February 2011. Kinder Morgan, Inc. was founded in 1997 and is headquartered in Houston, Texas.",
    "lastUpdated": "2025-12-19"
  },
  {
    "ticker": "KHC",
    "name": "The Kraft Heinz Company",
    "price": 24.75,
    "dividendYield": 0.06464646464646465,
    "payoutRatio": 0.7306,
    "consecutiveYears": 5,
    "peRatio": 9.822091,
    "roe": -0.09693,
    "debtToEquity": 0.50968,
    "low52": 23.7,
    "high52": 33.35,
    "sector": "Consumer Defensive",
    "dividendGrowth5Y": 0.0,
    "description": "The Kraft Heinz Company, together with its subsidiaries, manufactures and markets food and beverage products in North America and internationally. Its products include condiments and sauces, cheese and dairy products, meals, meats, refreshment beverages, coffee, and other grocery products under the Kraft, Oscar Mayer, Heinz, Philadelphia, Lunchables, Velveeta, Ore-Ida, Maxwell House, Kool-Aid, Jell-O, Heinz, ABC, Master, Quero, Kraft, Golden Circle, Wattie's, Pudliszki, and Plasmon brands. It sells its products through its own sales organizations, as well as through independent brokers, agents, and distributors to chain, wholesale, cooperative, and independent grocery accounts; convenience, value, and club stores; pharmacies and drug stores; mass merchants; foodservice distributors; institutions, including hotels, restaurants, bakeries, hospitals, health care facilities, and government agencies; and c various e-commerce platforms and retailers. The company was formerly known as H.J. Heinz Holding Corporation and changed its name to The Kraft Heinz Company in July 2015. The company was founded in 1869 and is based in Pittsburgh, Pennsylvania.",
    "lastUpdated": "2025-12-19"
  },
  {
    "ticker": "LKQ",
    "name": "LKQ Corporation",
    "price": 29.7,
    "dividendYield": 0.0404040404040404,
    "payoutRatio": 0.44439998,
    "consecutiveYears": 3,
    "peRatio": 9.002319,
    "roe": 0.10882,
    "debtToEquity": 0.83675,
    "low52": 28.13,
    "high52": 44.82,
    "sector": "Consumer Cyclical",
    "dividendGrowth5Y": 0.05,
    "description": "LKQ Corporation engages in the distribution of replacement parts, components, and systems used in the repair and maintenance of vehicles and specialty vehicle aftermarket products and accessories. The company operates through four segments: Wholesale-North America, Europe, Specialty, and Self Service. It offers bumper covers, automotive body panels, and lights, as well as paint and paint related consumables for refinishing vehicles; mechanical automotive parts and accessories; salvage products, including mechanical and collision parts comprising engines; transmissions; door assemblies; sheet metal products, such as trunk lids, fenders, and hoods; and lights and bumper assemblies. The company also provides scrap metal and other materials to metals recyclers; precious metals, such as catalytic converters; and brake pads, discs and sensors, clutches, steering and suspension products, filters, and oil and automotive fluids, as well as electrical products, including spark plugs and batteries. In addition, the company distributes recreational vehicle appliances and air conditioners, towing hitches, truck bed covers, vehicle protection products, marine electronics, cargo management products, wheels, tires, and suspension products. It serves collision and mechanical repair shops, new and used car dealerships, and retail customers. The company operates in the United States, Canada, Germany, the United Kingdom, Belgium, the Netherlands, Luxembourg, Italy, the Czech Republic, Austria, Poland, Slovakia, France, and other European countries. LKQ Corporation was incorporated in 1998 and is headquartered in Antioch, Tennessee.",
    "lastUpdated": "2025-12-19"
  },
  {
    "ticker": "LYB",
    "name": "LyondellBasell Industries NV",
    "price": 43.06,
    "dividendYield": 0.12726428239665583,
    "payoutRatio": 0.11468101000000001,
    "consecutiveYears": 1,
    "peRatio": 12.277251,
    "roe": -0.10584,
    "debtToEquity": 1.24319,
    "low52": 41.58,
    "high52": 79.39,
    "sector": "Basic Materials",
    "dividendGrowth5Y": 0.04894448445318189,
    "description": "LyondellBasell Industries N.V. operates as a chemical company in the United States, Germany, Mexico, Italy, Poland, France, Japan, China, the Netherlands, and internationally. The company operates in six segments: Olefins and Polyolefins\u0097Americas; Olefins and Polyolefins\u0097Europe, Asia, International; Intermediates and Derivatives; Advanced Polymer Solutions; Refining; and Technology. It produces and markets olefins and co-products, such as ethylene, aromatics, propylene and butadiene; polyolefins; polyethylene; and polypropylene homopolymers and copolymers; and propylene oxide and derivatives; oxyfuels and related products; and intermediate chemicals, such as styrene monomer, acetyls, and ethylene oxide. The company also produces and markets compounding and solutions, including polypropylene compounds, engineered plastics, masterbatches, engineered composites, colors and powders, and advanced polymers, such as catalloy and polybutene-1; and refines heavy, high-sulfur crude oil and other crude oils, as well as refined products, including gasoline and distillates. In addition, it develops and licenses chemical and polyolefin process technologies; manufactures and sells polyolefin catalysts; and serves food packaging, home furnishings, automotive components, and paints and coatings applications. LyondellBasell Industries N.V. was incorporated in 2009 and is headquartered in Houston, Texas.",
    "lastUpdated": "2025-12-19"
  },
  {
    "ticker": "MAA",
    "name": "Mid-America Apartment Communiti",
    "price": 136.31,
    "dividendYield": 0.04445748661140048,
    "payoutRatio": 1.2744,
    "consecutiveYears": 8,
    "peRatio": 39.395954,
    "roe": 0.09408,
    "debtToEquity": 0.87122,
    "low52": 125.75,
    "high52": 173.38,
    "sector": "Real Estate",
    "dividendGrowth5Y": 0.08895321224138986,
    "description": "MAA, a S&P 500 company, is a real estate investment trust (REIT) focused on delivering full-cycle and superior investment performance for shareholders through the ownership, management, acquisition, development and redevelopment of quality apartment communities primarily in the Southeast, Southwest and Mid-Atlantic regions of the United States. As of September 30, 2025, MAA had ownership interest in 104,665 apartment units, including communities currently in development, across 16 states and the District of Columbia.",
    "lastUpdated": "2025-12-19"
  },
  {
    "ticker": "OKE",
    "name": "ONEOK, Inc.",
    "price": 71.69,
    "dividendYield": 0.05746966104059144,
    "payoutRatio": 0.75,
    "consecutiveYears": 8,
    "peRatio": 12.050725,
    "roe": 0.17847,
    "debtToEquity": 1.5221799999999999,
    "low52": 64.02,
    "high52": 111.02,
    "sector": "Energy",
    "dividendGrowth5Y": 0.023255519910267086,
    "description": "ONEOK, Inc. operates as a midstream service provider of gathering, processing, fractionation, transportation, storage, and marine export services in the United States. It operates in four segments: Natural Gas Gathering and Processing; Natural Gas Liquids; Natural Gas Pipelines; and Refined Products and Crude. The company owns natural gas gathering pipelines and processing plants in the Mid-Continent, Permian Basin, North Texas, Gulf Coast region, and Rocky Mountain regions; and provides midstream services to producers of NGLs. It also owns NGL gathering and distribution pipelines, fractionation, terminal and storage facilities; and transports refined products, including gasoline, diesel fuel, aviation fuel, kerosene, and heating oil. In addition, the company transports and stores natural gas through regulated interstate and intrastate natural gas transmission pipelines, and natural gas storage facilities; it owns and operates a parking garage in downtown Tulsa, Oklahoma; and leases buildings, warehouses, office space, land, and equipment, including pipeline equipment, pipeline capacity, rail cars, and information technology equipment. Further, the company transports, stores, and distributes refined products, purity NGLs, and crude oil, as well as conducts commodity-related activities, including liquids blending and marketing activities. It serves integrated and independent exploration and production companies; other NGL and natural gas gathering and processing companies; crude oil and natural gas production companies; utilities; industrial companies; natural gasoline distributors; propane distributors; municipalities; ethanol producers; petrochemical, refining, and marketing companies; and diluent users, refineries, and exporters. ONEOK, Inc. was founded in 1906 and is headquartered in Tulsa, Oklahoma.",
    "lastUpdated": "2025-12-19"
  },
  {
    "ticker": "PFE",
    "name": "Pfizer, Inc.",
    "price": 25.04,
    "dividendYield": 0.06869009584664537,
    "payoutRatio": 0.9942,
    "consecutiveYears": 8,
    "peRatio": 8.30707,
    "roe": 0.105979994,
    "debtToEquity": 0.6653100000000001,
    "low52": 20.92,
    "high52": 27.69,
    "sector": "Healthcare",
    "dividendGrowth5Y": 0.04221537169101275,
    "description": "Pfizer Inc. discovers, develops, manufactures, markets, distributes, and sells biopharmaceutical products in the United States and internationally. The company offers medicines and vaccines in various therapeutic areas, including cardiovascular and migraine under the Eliquis, Nurtec ODT/Vydura, Zavzpret, and the Premarin family brands; infectious diseases with unmet medical needs under the Prevnar family, Abrysvo, Nimenrix, FSME/IMMUN-TicoVac, and Trumenba brands; and COVID-19 prevention and treatment, and potential future mRNA and antiviral products under the Comirnaty and Paxlovid brands. It also provides medicines and vaccines in various therapeutic areas, such as biosimilars for chronic immune and inflammatory diseases under the Xeljanz, Enbrel, Inflectra, Litfulo, Velsipity, and Cibinqo brands; amyloidosis, hemophilia, endocrine diseases, and sickle cell disease under the Vyndaqel family, Oxbryta, BeneFIX, Somavert, Ngenla, and Genotropin brands; sterile injectable and anti-infective medicines under the Sulperazon, Medrol, Zavicefta, Zithromax, Octagam, and Panzyga brands; and biologics, small molecules, immunotherapies, and biosimilars under the Ibrance, Xtandi, Padcev, Adcetris, Inlyta, Lorbrena, Bosulif, Tukysa, Braftovi, Mektovi, Orgovyx, Elrexfio, Tivdak, and Talzenna brands. In addition, the company involved in the contract manufacturing business. It serves wholesalers, retailers, hospitals, clinics, government agencies, pharmacies, individual provider offices, retail pharmacies, and integrated delivery systems. The company has collaboration agreements with Bristol-Myers Squibb Company; Astellas Pharma US, Inc.; Merck KGaA; and BioNTech SE. Pfizer Inc. was founded in 1849 and is headquartered in New York, New York.",
    "lastUpdated": "2025-12-19"
  },
  {
    "ticker": "PNW",
    "name": "Pinnacle West Capital Corporati",
    "price": 88.55,
    "dividendYield": 0.04110671936758894,
    "payoutRatio": 0.7381,
    "consecutiveYears": 8,
    "peRatio": 18.890667,
    "roe": 0.087749995,
    "debtToEquity": 1.97565,
    "low52": 81.47,
    "high52": 96.5,
    "sector": "Utilities",
    "dividendGrowth5Y": 0.03357152280696485,
    "description": "Pinnacle West Capital Corporation, through its subsidiary, provides retail and wholesale electric services primarily in the state of Arizona. The company engages in the generation, transmission, and distribution of electricity using nuclear, gas, oil, coal, and solar generating facilities. Its transmission facilities include overhead lines and underground lines; and distribution facilities consist of overhead lines and underground primary cables. The company also owns and maintains transmission and distribution substations; and owns energy storage facilities. Pinnacle West Capital Corporation was incorporated in 1985 and is headquartered in Phoenix, Arizona.",
    "lastUpdated": "2025-12-19"
  },
  {
    "ticker": "PGR",
    "name": "Progressive Corporation (The)",
    "price": 224.86,
    "dividendYield": 0.06181624121675709,
    "payoutRatio": 0.2689,
    "consecutiveYears": 2,
    "peRatio": 13.942782,
    "roe": 0.34223998,
    "debtToEquity": 0.19454999999999997,
    "low52": 199.9,
    "high52": 292.99,
    "sector": "Financial Services",
    "dividendGrowth5Y": -0.1638681836469692,
    "description": "The Progressive Corporation operates as an insurance company in the United States. The company writes insurance for personal autos and special lines products, including motorcycles, RVs, and watercraft; and personal residential property insurance for homeowners and renters. It also writes auto-related liability and physical damage insurance for comprising dump trucks, log trucks, garbage trucks, tractors, trailers, straight trucks, tow trucks and wreckers, vans, pick-up trucks, and autos; business-related general liability and commercial property insurance for small businesses; and workers' compensation insurance for the transportation industry. In addition, the company offers other specialty property-casualty insurance and provide related services; personal property reinsurance products; and involved in investment activities. It sells its products through independent insurance agencies, as well as online and over the phone. The Progressive Corporation was founded in 1937 and is headquartered in Mayfield Village, Ohio.",
    "lastUpdated": "2025-12-19"
  },
  {
    "ticker": "PRU",
    "name": "Prudential Financial, Inc.",
    "price": 115.55,
    "dividendYield": 0.04673301601038512,
    "payoutRatio": 0.7329,
    "consecutiveYears": 8,
    "peRatio": 7.738399,
    "roe": 0.085,
    "debtToEquity": 1.48723,
    "low52": 90.38,
    "high52": 123.88,
    "sector": "Financial Services",
    "dividendGrowth5Y": 0.05387395206178347,
    "description": "Prudential Financial, Inc., together with its subsidiaries, provides insurance, investment management, and other financial products and services in the United States, Japan and internationally. It operates through PGIM, Retirement Strategies, Group Insurance, Individual Life, and International Businesses segments. The PGIM segment offers investment management services and solutions related to public fixed income, public equity, real estate debt and equity, private credit and other alternatives, and multi-asset class strategies to institutional and retail clients, as well as its insurance and retirement businesses. The Retirement Strategies segment provides a range of retirement investment, and income products and services to retirement plan sponsors in the public, private, and not-for-profit sectors; develops and distributes individual variable and fixed annuity products. The Group Insurance segment offers various group life, and long-term and short-term group disability, as well as group corporate-, bank-, and trust-owned life insurance in the United States primarily for institutional clients for use in connection with employee and membership benefits plans; sells accidental death and dismemberment, and other supplemental health solutions; and plan administration services in connection with its insurance coverages. The Individual Life segment develops and distributes variable life, universal life, and term life insurance products. The International Businesses segment develops and distributes life insurance, retirement products, investment products, and certain accident and health products; and advisory and administration services . The company provides its products and services to individual and institutional customers through its proprietary and third-party distribution networks. Prudential Financial, Inc. was founded in 1875 and is headquartered in Newark, New Jersey.",
    "lastUpdated": "2025-12-19"
  },
  {
    "ticker": "PSA",
    "name": "Public Storage",
    "price": 261.37,
    "dividendYield": 0.04591192562268049,
    "payoutRatio": 1.2461,
    "consecutiveYears": 1,
    "peRatio": 25.398584,
    "roe": 0.19933,
    "debtToEquity": 1.06758,
    "low52": 256.6,
    "high52": 322.49,
    "sector": "Real Estate",
    "dividendGrowth5Y": 0.08447177119769855,
    "description": "Public Storage, a member of the S&P 500, is a REIT that primarily acquires, develops, owns, and operates self-storage facilities. At September 30, 2025, we: (i) owned and/or operated 3,491 self-storage facilities located in 40 states with approximately 254 million net rentable square feet in the United States and (ii) owned a 35% common equity interest in Shurgard Self Storage Limited (Euronext Brussels: SHUR), which owned 323 self-storage facilities located in seven Western European nations with approximately 18 million net rentable square feet operated under the Shurgard brand. Our headquarters are in Glendale, California.",
    "lastUpdated": "2025-12-19"
  },
  {
    "ticker": "O",
    "name": "Realty Income Corporation",
    "price": 56.77,
    "dividendYield": 0.05672009864364982,
    "payoutRatio": 0.029952999999999997,
    "consecutiveYears": 0,
    "peRatio": 35.388577,
    "roe": 0.02488,
    "debtToEquity": 0.73977,
    "low52": 50.71,
    "high52": 61.09,
    "sector": "Real Estate",
    "dividendGrowth5Y": 0.017323652445548454,
    "description": "Realty Income (NYSE: O), an S&P 500 company, is real estate partner to the world's leading companies. Founded in 1969, we serve our clients as a full-service real estate capital provider. As of September 30, 2025, we have a portfolio of over 15,500 properties in all 50 U.S. states, the U.K., and seven other countries in Europe. We are known as \"The Monthly Dividend Company\" and have a mission to invest in people and places to deliver dependable monthly dividends that increase over time. Since our founding, we have declared 666 consecutive monthly dividends and are a member of the S&P 500 Dividend Aristocrats index for having increased our dividend for over 30 consecutive years.",
    "lastUpdated": "2025-12-19"
  },
  {
    "ticker": "REG",
    "name": "Regency Centers Corporation",
    "price": 67.71,
    "dividendYield": 0.04460197902820854,
    "payoutRatio": 1.2936,
    "consecutiveYears": 8,
    "peRatio": 28.069695,
    "roe": 0.0602,
    "debtToEquity": 0.7310099999999999,
    "low52": 63.44,
    "high52": 78.18,
    "sector": "Real Estate",
    "dividendGrowth5Y": 0.030174499418471612,
    "description": "Regency Centers is a preeminent national owner, operator, and developer of shopping centers located in suburban trade areas with compelling demographics. Our portfolio includes thriving properties merchandised with highly productive grocers, restaurants, service providers, and best-in-class retailers that connect to their neighborhoods, communities, and customers. Operating as a fully integrated real estate company, Regency Centers is a qualified real estate investment trust (REIT) that is self-administered, self-managed, and an S&P 500 Index member.",
    "lastUpdated": "2025-12-19"
  },
  {
    "ticker": "SPG",
    "name": "Simon Property Group, Inc.",
    "price": 185.07,
    "dividendYield": 0.0475495758361701,
    "payoutRatio": 1.23,
    "consecutiveYears": 3,
    "peRatio": 26.889938,
    "roe": 0.82455003,
    "debtToEquity": 8.84863,
    "low52": 136.34,
    "high52": 190.14,
    "sector": "Real Estate",
    "dividendGrowth5Y": -0.004866411090246103,
    "description": "Simon Property Group, Inc. (NYSE:SPG) is a self-administered and self-managed real estate investment trust (\u0093REIT\u0094). Simon Property Group, L.P., or the Operating Partnership, is our majority-owned partnership subsidiary that owns all of our real estate properties and other assets. In this package, the terms Simon, we, our, or the Company refer to Simon Property Group, Inc., the Operating Partnership, and its subsidiaries. We own, develop and manage premier shopping, dining, entertainment and mixed-use destinations, which consist primarily of malls, Premium Outlets, The Mills, and International Properties. At December 31, 2024, we owned or had an interest in 229 properties comprising 183 million square feet in North America, Asia and Europe. We also owned an 88% interest in The Taubman Realty Group, or TRG, which owns 22 regional, super-regional, and outlet malls in the U.S. and Asia. Additionally, at December 31, 2024, we had a 22.4% ownership interest in Klepierre, a publicly traded, Paris-based real estate company, which owns shopping centers in 14 European countries.",
    "lastUpdated": "2025-12-19"
  },
  {
    "ticker": "SWKS",
    "name": "Skyworks Solutions, Inc.",
    "price": 64.49,
    "dividendYield": 0.04403783532330594,
    "payoutRatio": 0.91230005,
    "consecutiveYears": 8,
    "peRatio": 12.815035,
    "roe": 0.0789,
    "debtToEquity": 0.20898,
    "low52": 47.93,
    "high52": 95.46,
    "sector": "Technology",
    "dividendGrowth5Y": 0.10971906376020435,
    "description": "Skyworks Solutions, Inc., together with its subsidiaries, develops, manufactures, and markets analog and mixed-signal semiconductor products and solutions in the United States, Taiwan, China, South Korea, Europe, the Middle East, Africa, and the Asia Pacific. The company offers amplifiers, antenna tuners, attenuators, automotive tuners and digital radios, wireless ASoC, DC/DC converters, demodulators, detectors, digital power isolators, diodes, directional couplers, diversity receive modules, filters, front-end modules, hybrids, light emitting diode drivers, low noise amplifiers, mixers, modulators, and optocouplers/optoisolators. It also provides phase locked loops, phase shifters, power dividers/combiners, power over ethernet, power isolators, ProSLIC family of subscriber line interface circuits, receivers, system in package, switches, synthesizers, timing devices, voltage-controlled oscillators/synthesizers, and voltage regulators. The company sells its products through direct sales force, electronic component distributors, and independent sales representatives. Its products are used in aerospace, automotive, broadband, cellular infrastructure, connected home, defense, entertainment and gaming, industrial, medical, smartphone, tablet, and wearables applications. The company was founded in 1962 and is headquartered in Irvine, California.",
    "lastUpdated": "2025-12-19"
  },
  {
    "ticker": "SJM",
    "name": "The J.M. Smucker Company",
    "price": 100.37,
    "dividendYield": 0.043837800139483914,
    "payoutRatio": 0.8606,
    "consecutiveYears": 8,
    "peRatio": 10.106625,
    "roe": -0.17438,
    "debtToEquity": 1.31357,
    "low52": 93.3,
    "high52": 121.48,
    "sector": "Consumer Defensive",
    "dividendGrowth5Y": 0.04345454255062631,
    "description": "The J. M. Smucker Company manufactures and markets branded food and beverage products worldwide. The company operates through four segments: U.S. Retail Coffee, U.S. Retail Frozen Handheld and Spreads, U.S. Retail Pet Foods, and Sweet Baked Snacks. It offers coffee, sweet baked goods, pet snacks, frozen handheld products, peanut butter, cat and dog food, fruit and specialty spreads, cookies, frozen sandwiches and snacks, hot beverages, portion control products, toppings and syrups, baking mixes and ingredients, and flour. The company provides its products under the Folgers, Café Bustelo, Dunkin', Jif, Smucker's, Smucker's Uncrustables, Meow Mix, Milk-Bone, Pup-Peroni, Canine Carry Outs, Hostess, 1850, Robin Hood, and Five Roses brands. The company sells its products through direct sales and brokers to food retailers, club stores, discount and dollar stores, online retailers, pet specialty stores, distributors, drug stores, military commissaries, mass merchandisers, supermarket chains, national mass retailers, convenience stores, vending channels, and foodservice distributors and operators. The J. M. Smucker Company was founded in 1897 and is headquartered in Orrville, Ohio.",
    "lastUpdated": "2025-12-19"
  },
  {
    "ticker": "SW",
    "name": "Smurfit WestRock plc",
    "price": 38.62,
    "dividendYield": 0.044536509580528225,
    "payoutRatio": 1.0924,
    "consecutiveYears": 3,
    "peRatio": 11.72805,
    "roe": 0.04099,
    "debtToEquity": 0.76445,
    "low52": 32.729,
    "high52": 56.05,
    "sector": "Consumer Cyclical",
    "dividendGrowth5Y": 0.10910611632926281,
    "description": "Smurfit Westrock Plc, together with its subsidiaries, manufactures, distributes, and sells containerboard, corrugated containers, and other paper-based packaging products. The company produces containerboard; packaging of corrugated containers; consumer packaging; and offers solid board, kraft paper, and graphic board, as well as other packaging products, such as solidboard packaging, paper sacks and bag-in-box. It produces linerboard and corrugated medium, paperboard, and non-packaging grades of paper, as well as converted products, such as folding cartons and corrugated boxes, and other products; recycled paper-based packaging products; and packaging machinery. The company primarily serves food and beverage, e-commerce, retail, consumer goods, industrial, and foodservice markets in 40 countries. Smurfit Westrock Plc was founded in 1934 and is headquartered in Dublin, Ireland.",
    "lastUpdated": "2025-12-19"
  },
  {
    "ticker": "SWK",
    "name": "Stanley Black & Decker, Inc.",
    "price": 72.94,
    "dividendYield": 0.0455168631752125,
    "payoutRatio": 1.1345,
    "consecutiveYears": 8,
    "peRatio": 12.555513,
    "roe": 0.04918,
    "debtToEquity": 0.78538,
    "low52": 53.91,
    "high52": 91.06,
    "sector": "Industrials",
    "dividendGrowth5Y": 0.03841455588022602,
    "description": "Stanley Black & Decker, Inc. provides hand tools, power tools, outdoor products, and related accessories in the United States, Canada, Other Americas, Europe, and Asia. The company's Tools & Outdoor segment offers professional grade corded and cordless electric power tools and equipment, including drills, impact wrenches and drivers, grinders, saws, routers, concrete prep and placement tools, and sanders; pneumatic tools and fasteners, such as nail guns, nails, staplers and staples, and concrete and masonry anchors; corded and cordless electric power tools; hand-held vacuums, paint tools, and cleaning appliances; leveling and layout tools, planes, hammers, demolition tools, clamps, vises, knives, saws, chisels, and industrial and automotive tools; drill, screwdriver, router bits, abrasives, saw blades, and threading products; tool boxes, sawhorses, medical cabinets, and engineered storage solutions; and electric and gas-powered lawn and garden products. This segment sells its products under the DEWALT, CRAFTSMAN, CUB ADET, BLACK+DECKER, and HUSTLER brands through retailers, third-party distributors, independent dealers, and a direct sales force. Its Industrial segment provides threaded fasteners, blind rivets and tools, blind inserts and tools, drawn arc weld studs and systems, engineered plastic and mechanical fasteners, self-piercing riveting systems, precision nut running systems, micro fasteners, high-strength structural fasteners, axel swage, latches, heat shields, pins, couplings, fitting, and other engineered products; and attachments used on excavators and handheld tools. This segment sells its products through direct sales force and third-party distributors to the automotive, manufacturing, electronics, construction, aerospace, and other industries. The company was formerly known as The Stanley Works and changed its name to Stanley Black & Decker, Inc. in March 2010. The company was founded in 1843 and is headquartered in New Britain, Connecticut.",
    "lastUpdated": "2025-12-19"
  },
  {
    "ticker": "TROW",
    "name": "T. Rowe Price Group, Inc.",
    "price": 103.32,
    "dividendYield": 0.04916763453348819,
    "payoutRatio": 0.5507,
    "consecutiveYears": 2,
    "peRatio": 10.042241,
    "roe": 0.1867,
    "debtToEquity": 0.0409,
    "low52": 77.85,
    "high52": 118.32,
    "sector": "Financial Services",
    "dividendGrowth5Y": 0.10286313147852999,
    "description": "T. Rowe Price Group, Inc. is a publicly owned investment manager. The firm provides its services to individuals, institutional investors, retirement plans, financial intermediaries, and institutions. It launches and manages equity and fixed income mutual funds. The firm invests in the public equity and fixed income markets across the globe. It employs fundamental and quantitative analysis with a bottom-up approach. The firm utilizes in-house and external research to make its investments. It employs socially responsible investing with a focus on environmental, social, and governance issues. It makes investment in late-stage venture capital transactions and usually invests between $3 million and $5 million. The firm was previously known as T. Rowe Group, Inc. and T. Rowe Price Associates, Inc. T. Rowe Price Group, Inc. was founded in 1937 and is based in Baltimore, Maryland, with additional offices in Colorado Springs, Colorado; Owings Mills, Maryland; San Francisco, California; New York, New York; Philadelphia, Pennsylvania; Tampa, Florida; Toronto, Ontario; Hellerup, Denmark; Amsterdam, The Netherlands; Luxembourg, Grand Duchy of Luxembourg; Zurich, Switzerland; Dubai, United Arab Emirates; London, United Kingdom; Sydney, New South Wales; Hong Kong; Tokyo, Japan; Singapore; Frankfurt, Shanghai, China; Germany, Madrid, Spain, Milan, Italy, Stockholm, Sweden, Melbourne, Australia, Amsterdam, Netherlands and Washington, DC.",
    "lastUpdated": "2025-12-19"
  },
  {
    "ticker": "TGT",
    "name": "Target Corporation",
    "price": 99.05,
    "dividendYield": 0.04603735487127713,
    "payoutRatio": 0.5455,
    "consecutiveYears": 8,
    "peRatio": 12.8978405,
    "roe": 0.25094998,
    "debtToEquity": 1.3206200000000001,
    "low52": 83.44,
    "high52": 145.08,
    "sector": "Consumer Defensive",
    "dividendGrowth5Y": 0.11296606958799793,
    "description": "Target Corporation operates as a general merchandise retailer in the United States. The company offers apparel for women, men, young adults, kids, toddlers, and babies, as well as jewelry, accessories, and shoes; and beauty products, such as skin and bath care, cosmetics, hair care, oral care, deodorant, and shaving products. It also provides food and beverage products comprising dry and perishable grocery, including snacks, candy, beverages, deli, bakery, meat, produce, and food service; electronics which includes video games and consoles, toys, sporting goods, entertainment, and luggage; bed and bath, home décor, school/office supplies, storage, small appliances, kitchenware, greeting cards, party supplies, furniture, lighting, home improvement, and seasonal merchandise; and household essentials, such as household cleaning, paper products, over-the-counter healthcare, vitamins and supplements, baby gear, and pet supplies. In addition, the company sells merchandise through periodic design and creative partnerships, and shop-in-shop experience; and in-store amenities. It sells its products through its stores; and digital channels, including Target.com. Target Corporation was incorporated in 1902 and is headquartered in Minneapolis, Minnesota.",
    "lastUpdated": "2025-12-19"
  },
  {
    "ticker": "TDG",
    "name": "Transdigm Group Incorporated",
    "price": 1262.78,
    "dividendYield": 0.07133572,
    "payoutRatio": 0.0,
    "consecutiveYears": 4,
    "peRatio": 27.629692,
    "roe": 0,
    "debtToEquity": 0,
    "low52": 1183.6,
    "high52": 1623.83,
    "sector": "Industrials",
    "dividendGrowth5Y": 0.03713728933664817,
    "description": "TransDigm Group Incorporated designs, produces, and supplies aircraft components in the United States and internationally. The Power & Control segment offers mechanical/electro-mechanical actuators and controls, ignition systems and engine technology, specialized pumps and valves, power conditioning devices, specialized AC/DC electric motors and generators, batteries and chargers, databus and power controls, sensor products, switches and relay panels, hoists, winches and lifting devices, cargo loading and handling systems, delivery systems, and electronic components. Its Airframe segment provides engineered latching and locking devices, engineered rods, engineered connectors and elastomer sealing solutions, cockpit security components and systems, cockpit displays, lavatory components, seat belts and safety restraints, engineered and customized interior surfaces and related components, thermal protection and insulation products, lighting and control technology, parachutes, specialized flight, wind tunnel and jet engine testing services and equipment, and testing and instrumentation solutions, as well as engineered audio, radio, and antenna systems. The Non-Aviation segment offers seat belts and safety restraints; mechanical/electromechanical actuators and controls; hydraulic/electromechanical actuators and fuel valves; refueling systems; and turbine controls. It serves engine and power system and subsystem suppliers, airlines, third party maintenance suppliers, military buying agencies, and repair depots; airframe manufacturers, cabin system and subsystem suppliers, airlines, and third party maintenance suppliers; and off-road vehicle and subsystem suppliers, child restraint system suppliers, and satellite and space system suppliers, as well as manufacturers of heavy equipment. The company was formerly known as TD Holding Corporation and changed its name to TransDigm Group Incorporated in 2006. The company was founded in 1993 and is headquartered in Cleveland, Ohio.",
    "lastUpdated": "2025-12-19"
  },
  {
    "ticker": "TFC",
    "name": "Truist Financial Corporation",
    "price": 49.94,
    "dividendYield": 0.04164997997597117,
    "payoutRatio": 0.55759996,
    "consecutiveYears": 8,
    "peRatio": 11.201805,
    "roe": 0.07982,
    "debtToEquity": 0,
    "low52": 33.56,
    "high52": 50.49,
    "sector": "Financial Services",
    "dividendGrowth5Y": 0.03995236023707016,
    "description": "Truist Financial Corporation, a financial services company, provides banking and trust services in the Southeastern and Mid-Atlantic United States. The company operates through two segments, Consumer and Small Business Banking; and Wholesale Banking. Its deposit products include noninterest-bearing checking, interest-bearing checking, savings, and money market deposit accounts, as well as certificates of deposit and individual retirement accounts. The company also provides funding; asset management; automobile lending; credit card lending; consumer finance; home equity and mortgage lending; other direct retail lending; home mortgage lending; Investment brokerage services; mobile/online banking; payment solutions; point-of-sale lending; retail and small business deposit products; and small business lending. In addition, it offers asset-based lending, commercial deposit and treasury services; commercial lending; floor plan lending; derivatives; institutional trust services; insurance premium finance; international banking; investment banking and capital markets services; leasing; merchant services; mortgage warehouse lending; real estate lending; supply chain financing; and wealth management/private banking. The company was formerly known as BB&T Corporation and changed its name to Truist Financial Corporation in December 2019. Truist Financial Corporation was founded in 1872 and is headquartered in Charlotte, North Carolina.",
    "lastUpdated": "2025-12-19"
  },
  {
    "ticker": "UDR",
    "name": "UDR, Inc.",
    "price": 36.12,
    "dividendYield": 0.04761904761904762,
    "payoutRatio": 0.038864002,
    "consecutiveYears": 8,
    "peRatio": 64.5,
    "roe": 0.03649,
    "debtToEquity": 1.44858,
    "low52": 32.94,
    "high52": 46.47,
    "sector": "Real Estate",
    "dividendGrowth5Y": 0.04625754330218412,
    "description": "UDR, Inc. (NYSE: UDR), an S&P 500 company, is a leading multifamily real estate investment trust with a demonstrated performance history of delivering superior and dependable returns by successfully managing, buying, selling, developing and redeveloping attractive real estate communities in targeted U.S. markets. As of September 30, 2025, UDR owned or had an ownership position in 60,535 apartment homes, including 300 apartment homes under development. For over 53 years, UDR has delivered long-term value to shareholders, the best standard of service to Residents and the highest quality experience for Associates.",
    "lastUpdated": "2025-12-19"
  },
  {
    "ticker": "UPS",
    "name": "United Parcel Service, Inc.",
    "price": 102.08,
    "dividendYield": 0.06426332288401254,
    "payoutRatio": 1.0124,
    "consecutiveYears": 8,
    "peRatio": 14.24948,
    "roe": 0.33618,
    "debtToEquity": 1.8432,
    "low52": 82.0,
    "high52": 136.99,
    "sector": "Industrials",
    "dividendGrowth5Y": 0.11168891263801872,
    "description": "United Parcel Service, Inc., a package delivery and logistics provider, offers transportation and delivery services. It operates through two segments, U.S. Domestic Package and International Package. The U.S. Domestic Package segment offers time-definite delivery services for express letters, documents, packages and palletized freight through air and ground services in the United States. The International Package segment provides small package operations in Europe, the Indian sub-continent, the Middle East and Africa, Canada and Latin America, and Asia. The company offers a range of guaranteed day- and time-definite international shipping services; day-definite services; cross-border ground package delivery; contract-only, e-commerce solutions for non-urgent, and cross-border shipments; and international service for urgent and palletized shipments. It also provides international air and ocean freight forwarding, contract logistics, custom brokerage and insurance, mail services, healthcare logistics, distribution, and post-sales services. United Parcel Service, Inc. was founded in 1907 and is headquartered in Atlanta, Georgia.",
    "lastUpdated": "2025-12-19"
  },
  {
    "ticker": "VZ",
    "name": "Verizon Communications Inc.",
    "price": 40.41,
    "dividendYield": 0.06829992576095026,
    "payoutRatio": 0.5805,
    "consecutiveYears": 8,
    "peRatio": 8.42333,
    "roe": 0.19875,
    "debtToEquity": 1.64799,
    "low52": 37.59,
    "high52": 47.36,
    "sector": "Communication Services",
    "dividendGrowth5Y": 0.019748954322792667,
    "description": "Verizon Communications Inc., through its subsidiaries, engages in the provision of communications, technology, information, and entertainment products and services to consumers, businesses, and governmental entities worldwide. It operates in two segments, Verizon Consumer Group (Consumer) and Verizon Business Group (Business). The Consumer segment provides wireless services across the wireless networks in the United States under the Verizon and TracFone brands and through wholesale and other arrangements; and fixed wireless access (FWA) broadband through its wireless networks, as well as related equipment and devices, such as smartphones, tablets, smart watches, and other wireless-enabled connected devices. The segment also offers wireline services in the Mid-Atlantic and Northeastern United States, as well as Washington D.C. through its fiber-optic network, Verizon Fios product portfolio, and a copper-based network. The Business segment provides wireless and wireline communications services and products, including FWA broadband, data, video and conferencing, corporate networking, security and managed network, local and long-distance voice, and network access services to deliver various IoT services and products to businesses, government customers, and wireless and wireline carriers in the United States and internationally. The company was formerly known as Bell Atlantic Corporation and changed its name to Verizon Communications Inc. in June 2000. Verizon Communications Inc. was incorporated in 1983 and is headquartered in New York, New York.",
    "lastUpdated": "2025-12-19"
  },
  {
    "ticker": "VTRS",
    "name": "Viatris Inc.",
    "price": 11.94,
    "dividendYield": 0.04020100502512563,
    "payoutRatio": 0.096,
    "consecutiveYears": 3,
    "peRatio": 4.848396,
    "roe": -0.21087,
    "debtToEquity": 0.9703,
    "low52": 6.85,
    "high52": 12.68,
    "sector": "Healthcare",
    "dividendGrowth5Y": 0.05,
    "description": "Viatris Inc., together with its subsidiaries, operates as a healthcare company in North America, Europe, China, Taiwan, Hong Kong, Japan, Australia, New Zealand, rest of Asia, Africa, Latin America, and the Middle East. It operates in four segments: Developed Markets, Greater China, JANZ, and Emerging Markets. The company offers prescription brand drugs, generic drugs, complex generic drugs, and biosimilars. It also provides drugs in various therapeutic areas covering various noncommunicable and infectious diseases, including cardiovascular, CNS and anesthesia, dermatology, diabetes and metabolism, eye care, gastroenterology, immunology, oncology, and respiratory and allergy, as well as support services, such as diagnostic clinics, educational seminars, and digital tools to help patients better manage their health. In addition, the company offers medicines in the form of oral solid doses, injectables, and complex dosage forms to retail and pharmacy establishments, wholesalers and distributors, payers, insurers and governments, and institutions. It distributes its products through pharmaceutical wholesalers/distributors, pharmaceutical retailers, institutional pharmacies, mail-order and e-commerce pharmacies, and specialty pharmacies. The company sells its products under the Lyrica, Lipitor, Celebrex, Viagra, Creon, Influvac, Wixela Inhub, EpiPen Auto-Injector, Fraxiparine, Yupelri, Norvasc, Amitiza, Effexor, Lipacreon, Zoloft, Xalabrands, Dymista, Xanax, and Breyna brands. It has collaboration agreements with Mapi Pharma Ltd. to develop and commercialize long-acting glatiramer acetate depot products and additional products; Revance Therapeutics, Inc. to develop, manufacture, and commercialize a biosimilar to the branded biologic product, BOTOX; and Theravance Biopharma, Inc. to develop and commercialize revefenacin. Viatris Inc. was founded in 1961 and is headquartered in Canonsburg, Pennsylvania.",
    "lastUpdated": "2025-12-19"
  },
  {
    "ticker": "VICI",
    "name": "VICI Properties Inc.",
    "price": 28.1,
    "dividendYield": 0.06298932384341636,
    "payoutRatio": 0.66440004,
    "consecutiveYears": 6,
    "peRatio": 9.8423815,
    "roe": 0.10357001,
    "debtToEquity": 0.62925,
    "low52": 27.63,
    "high52": 34.03,
    "sector": "Real Estate",
    "dividendGrowth5Y": 0.07671223289257934,
    "description": "VICI Properties Inc. is an S&P 500 experiential real estate investment trust that owns one of the largest portfolios of market-leading gaming, hospitality, wellness, entertainment and leisure destinations, including Caesars Palace Las Vegas, MGM Grand and the Venetian Resort Las Vegas, three of the most iconic entertainment facilities on the Las Vegas Strip. VICI Properties owns 93 experiential assets across a geographically diverse portfolio consisting of 54 gaming properties and 39 other experiential properties across the United States and Canada. The portfolio is comprised of approximately 127 million square feet and features approximately 60,300 hotel rooms and over 500 restaurants, bars, nightclubs and sportsbooks. Its properties are occupied by industry-leading gaming, leisure and hospitality operators under long-term, triple-net lease agreements. VICI Properties has a growing array of real estate and financing partnerships with leading developers and operators in other experiential sectors, including Cabot, Cain, Canyon Ranch, Chelsea Piers, Great Wolf Resorts, Homefield, Kalahari Resorts and Lucky Strike Entertainment. VICI Properties also owns four championship golf courses and approximately 33 acres of undeveloped and underdeveloped land adjacent to the Las Vegas Strip. VICI Properties' goal is to create the highest quality and most productive experiential real estate portfolio through a strategy of partnering with the highest quality experiential place makers and operators.",
    "lastUpdated": "2025-12-19"
  }
]